


// - створити функцію, яка генерує масив рандомних числових цілих значень в діапазоні від 0 до 100.
//
function nambers (a, b) {
    for (let i=0; i<b; i+=6) {
        console.log(i)
    }
}
nambers(0, 100 )

// - Змінти попередню функцію, щоб діапазон можна було визначити через аргументи.

// function nambers2 (a, b, c) {
//     for (let i=0; i<b; i=c) {
//         console.log(i)
//     }
// }
// nambers2 (0, 100, 6)

// - створити (або згенерувати, за допомоги попередньої функції) масив рандомних цілих числових значень. Відсортувати його за допомоги sort

function nambers3 (a, b, c) {
    for (let i=0; i<b; i=c) {
        console.log(i)
    }
}
nambers3 (0, 100, 6)


let strings = nambers3.sort();
console.log(strings)

// - створити (або згенерувати, за допомоги попередньої функції) масив рандомних цілих числових значень. відфільтрувати  його за допомоги
// filter, за лишивши тільки парні числа


nambers.3






